 Data Manipulation with Pandas
 Pandas is a package built on top of NumPy, and provides an efficient implementation of a dataframe.
 There are 3 fundamental Pandas data structures:
• Series
• DataFrame
• Indexe

Panda Series with object

In [1]:
import pandas as pd

data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [2]:
type(data)

pandas.core.series.Series

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data[1:3]

1    0.50
2    0.75
dtype: float64

Series as generalized NumPy Array

In [6]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

Series as specialized dictionary

In [7]:
population_dict = {'California': 38,
'Texas': 26,
'New York': 20,
'Florida':19,
'Illinois': 13
}         # population in million

population = pd.Series(population_dict)
population

California    38
Texas         26
New York      20
Florida       19
Illinois      13
dtype: int64

In [8]:
population['California':'New York']

California    38
Texas         26
New York      20
dtype: int64

Constructing Series Objects

In [9]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [10]:
pd.Series(7, index=[10, 20, 30, 30])

10    7
20    7
30    7
30    7
dtype: int64

In [11]:
pd.Series({2:'a', 5:'b', 3:'c'})

2    a
5    b
3    c
dtype: object

In [12]:
# index can be explicitly set if preferred
pd.Series({2:'a', 5:'b', 3:'c'}, index=[3, 2]) # index 5 is discarded since it is not in the index list

3    c
2    a
dtype: object

DataFrame as a generalized NumPy Array

In [13]:
area_dict = {'California': 423,
'Texas': 695,
'New York': 141,
'Florida': 170,
'Illinois': 150
} # area in thousand sq. miles

In [14]:
area = pd.Series(area_dict)
area

California    423
Texas         695
New York      141
Florida       170
Illinois      150
dtype: int64

In [15]:
states = pd.DataFrame({'population': population,
'area': area
})
states

            population  area
California          38   423
Texas               26   695
New York            20   141
Florida             19   170
Illinois            13   150

In [16]:
 states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [17]:
states.columns

Index(['population', 'area'], dtype='object')

DataFrame as specialized dictionary

In [18]:
states['area']

California    423
Texas         695
New York      141
Florida       170
Illinois      150
Name: area, dtype: int64

In [19]:
#Constructing DataFrame objects
pd.DataFrame(population, columns=['population'])

            population
California          38
Texas               26
New York            20
Florida             19
Illinois            13

In [20]:
data = [{'a': i, 'b': 2*i} for i in range(6)]
pd.DataFrame(data)

   a   b
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10

In [21]:
pd.DataFrame([{'a': 2, 'b': 5}, {'b': 7, 'c': 1}])

     a  b    c
0  2.0  5  NaN
1  NaN  7  1.0

In [22]:
pd.DataFrame({'population': population,
'area': area
})

            population  area
California          38   423
Texas               26   695
New York            20   141
Florida             19   170
Illinois            13   150

In [23]:
import numpy as np
pd.DataFrame(np.random.rand(3, 2),
columns = ['foo', 'bar'],
index = ['a', 'b', 'c'])

        foo       bar
a  0.312918  0.882444
b  0.797396  0.864889
c  0.136995  0.040567

In [24]:
pd.DataFrame(np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')]))

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

Pandas Index Object

In [25]:
import pandas as pd
ind = pd.Index([1, 5, 3, 9, 7])
ind

Index([1, 5, 3, 9, 7], dtype='int64')

In [26]:
print(ind.ndim, ind.shape, ind.size, ind.dtype)

1 (5,) 5 int64

In [27]:
#Series as a Dictionary

import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [28]:
#Indexers: loc and iloc

data = pd.Series(['x', 'y', 'z'], index=[1, 3, 5])
data

1    x
3    y
5    z
dtype: object

In [29]:
data.loc[1] # using explicit indexing using loc

'x'

In [30]:
data.iloc[1]  # referencing by implicit index using iloc

'y'

DataFrame as a dictionary

In [31]:
area = pd.Series({'California': 424,
'Texas': 696,
'New York': 141,
'Florida': 170,
'Illinois': 150
})

In [32]:
 population = pd.Series({'California': 38,
'Texas': 26,
'New York': 19,
'Florida': 20,
'Illinois': 129
})

In [33]:
data = pd.DataFrame({'area': area, 'population': population})
data

            area  population
California   424          38
Texas        696          26
New York     141          19
Florida      170          20
Illinois     150         129

In [34]:
data['density'] = data['population'] / data['area']
data

            area  population   density
California   424          38  0.089623
Texas        696          26  0.037356
New York     141          19  0.134752
Florida      170          20  0.117647
Illinois     150         129  0.860000

In [35]:
#DataFrame as a 2-dimensional array

data.values

array([[4.24000000e+02, 3.80000000e+01, 8.96226415e-02],
       [6.96000000e+02, 2.60000000e+01, 3.73563218e-02],
       [1.41000000e+02, 1.90000000e+01, 1.34751773e-01],
       [1.70000000e+02, 2.00000000e+01, 1.17647059e-01],
       [1.50000000e+02, 1.29000000e+02, 8.60000000e-01]])

In [36]:
data.T # transposing the dataframe (rows become columns; columns become rows)

            California       Texas    New York     Florida  Illinois
area        424.000000  696.000000  141.000000  170.000000    150.00
population   38.000000   26.000000   19.000000   20.000000    129.00
density       0.089623    0.037356    0.134752    0.117647      0.86

In [37]:
# implicit indexing
data.iloc[:3, :2] # rows 0, 1, 2 and cols 0, 1

            area  population
California   424          38
Texas        696          26
New York     141          19

In [38]:
 # explicit indexing
#data.loc[:'New York' :'population'] # rows upto 'New York'; cols up to 'population'

In [39]:
data.loc[data.density > 0.1, ['population', 'density']]

          population   density
New York          19  0.134752
Florida           20  0.117647
Illinois         129  0.860000

In [40]:
data.iloc[0, 2] = 0.99 # update row 0, col 2 to a new value
data

            area  population   density
California   424          38  0.990000
Texas        696          26  0.037356
New York     141          19  0.134752
Florida      170          20  0.117647
Illinois     150         129  0.860000

Operating on Data in Pandas.
Ufuncs: Index Preservation
Any NumPy ufuncs works on Pandas Series and DataFrame objects.

In [41]:
import pandas as pd
import numpy as np
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4)) # a Series object
ser

0    6
1    3
2    7
3    4
dtype: int32

In [42]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D']) # a DataFrame object
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [43]:
np.exp(ser) # exponential (e^element) of each element in the Series

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [44]:
#Index alignment in Series

area = pd.Series({'Alaska': 172,
'Texas': 696,
'California': 424
}, name = 'area')

In [45]:
population = pd.Series({'California': 38,
'Texas': 26,
'New York': 19
}, name = 'area')

In [46]:
population / area

Alaska             NaN
California    0.089623
New York           NaN
Texas         0.037356
Name: area, dtype: float64

In [47]:
#Index alignment in DataFrame

A = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [48]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [49]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [50]:
A.add(B, fill_value=0)

      A     B    C
0   1.0  15.0  9.0
1  13.0   6.0  0.0
2   2.0   9.0  6.0

In [51]:
#Ufuncs: Operations Between DataFrame and Series

A = rng.randint(10, size=(3, 4)) # 2-dim array
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [52]:
A - A[0]   # A minus the first row of A (broadcasting); 2-dim array - 1-dim array

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [53]:
df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  3  8  2  4
1  2  6  4  8
2  6  1  3  8

In [54]:
# dataframe - series
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [55]:
#Missing Data in Pandas
import numpy as np
import pandas as pd
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [56]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [57]:
1 + np.nan

nan

In [58]:
0 * np.nan

nan

In [59]:
 # aggregates over values involving NaN
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [60]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [61]:
#NaN and None in Pandas

pd.Series([1, 2, np.nan, 4, None])

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
dtype: float64

In [62]:
import pandas as pd
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [63]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [64]:
#Operating on Null Values
#Detecting null values

import pandas as pd
import numpy as np
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [65]:
data.isnull() # returns a Boolean mask over the data

0    False
1     True
2    False
3     True
dtype: bool

In [66]:
data[data.notnull()] # Boolean mask returned by notnull() in Series index

0        1
2    hello
dtype: object

In [67]:
#Dropping null values
data.dropna() # removes the NA values

0        1
2    hello
dtype: object

In [68]:
import numpy as np
import pandas as pd
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [69]:
df.dropna() # drops all rows with NA

     0    1  2
1  2.0  3.0  5

In [70]:
df.dropna(axis='columns') # same as df.dropna(axis=1); drops all columns with null values

   2
0  2
1  5
2  6

In [71]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [72]:
df.dropna(axis='columns', how='all') # drops columns with all null values

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [73]:
df.dropna(axis='rows', thresh=3) # keep only rows with a minimum of 3 non-null values

     0    1  2   3
1  2.0  3.0  5 NaN

In [74]:
#Filling null values
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [75]:
# fill NA entries with a single value, e.g. zero
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [76]:
# specify a forward-fill to propagate the previous value forward
data.fillna(method='ffill')

C:\Users\hp\AppData\Local\Temp\ipykernel_9068\2459074274.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [77]:
# specify a back-fill to propagate the next values forward
data.fillna(method='bfill')

C:\Users\hp\AppData\Local\Temp\ipykernel_9068\2275049553.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [78]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [79]:
df.fillna(method='ffill', axis=1)

C:\Users\hp\AppData\Local\Temp\ipykernel_9068\901808322.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

Combining Datasets: Merge and Join

In [80]:
#Categories of join
#one to one joins

import pandas as pd

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue',],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue',],
                    'hire_date' : [2004, 2008, 2011, 2009]})

print(df1); print('-'*20); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
  employee  hire_date
0      Bob       2004
1     Jake       2008
2     Lisa       2011
3      Sue       2009

In [81]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2011
3      Sue           HR       2009

In [82]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print('-'*20); print(df4)

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2011
3      Sue           HR       2009
--------------------
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [83]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2004      Carly
1     Jake  Engineering       2008      Guido
2     Lisa  Engineering       2011      Guido
3      Sue           HR       2009      Steve

In [84]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering','Engineering', 'HR', 'HR'],
'skills': ['math', 'spreadsheets', 'coding', 'linux','spreadsheets', 'organization']})

print(df1); print('-'*20); print(df5)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [85]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [86]:
print(df1); print('-'*20); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
  employee  hire_date
0      Bob       2004
1     Jake       2008
2     Lisa       2011
3      Sue       2009

In [87]:
pd.merge(df1, df2, on='employee')  #on keyword

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jake  Engineering       2008
2     Lisa  Engineering       2011
3      Sue           HR       2009

In [88]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'salary': [70000, 80000, 120000, 90000]
})
print(df1); print('-'*20); print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [89]:
#joining on 'employee' and 'name'
pd.merge(df1, df3, left_on='employee', right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [90]:
# 'name' column dropped
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [91]:
df1a = df1.set_index('employee') # setting the 'employee' column as explicit index on df1
df2a = df2.set_index('employee') # setting the 'employee' column as explicit index on df2
print(df1a); print('-'*20); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
--------------------
          hire_date
employee
Bob            2004
Jake           2008
Lisa           2011
Sue            2009

In [92]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2004
Jake      Engineering       2008
Lisa      Engineering       2011
Sue                HR       2009

In [93]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2004
Jake      Engineering       2008
Lisa      Engineering       2011
Sue                HR       2009

Specifying Set Arithmetic for Joins

In [94]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                   'drink': ['wine', 'beer']},
columns=['name', 'drink'])
print(df6); print('-'*20); print(df7);

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
--------------------
     name drink
0    Mary  wine
1  Joseph  beer

In [95]:
 pd.merge(df6, df7)

   name   food drink
0  Mary  bread  wine

In [96]:
pd.merge(df6, df7, how='inner')              #explicit inner join

   name   food drink
0  Mary  bread  wine

In [97]:
print(df6); print('-'*20); print(df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
--------------------
     name drink
0    Mary  wine
1  Joseph  beer

In [98]:
pd.merge(df6, df7, how='outer')

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

In [99]:
pd.merge(df6, df7, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [100]:
pd.merge(df6, df7, how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

Overlapping Column Names: The suffixes Keyword

In [101]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
print(df8); print('-'*20) ;print(df9);

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
--------------------
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [102]:
pd.merge(df8, df9, on="name")

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [103]:
pd.merge(df8, df9, on='name', suffixes=['_Left', '_Right'])

   name  rank_Left  rank_Right
0   Bob          1           3
1  Jake          2           1
2  Lisa          3           4
3   Sue          4           2

In [104]:
# download state population data
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
 64 57935   64 37206    0     0  45091      0  0:00:01 --:--:--  0:00:01 46333
100 57935  100 57935    0     0  64540      0 --:--:-- --:--:-- --:--:-- 66135

In [105]:
# download state areas data
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   835  100   835    0     0   1363      0 --:--:-- --:--:-- --:--:--  1387

In [106]:
# download state population data
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 57935  100 57935    0     0   116k      0 --:--:-- --:--:-- --:--:--  119k

In [107]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   872  100   872    0     0   1415      0 --:--:-- --:--:-- --:--:--  1441
100   872  100   872    0     0   1414      0 --:--:-- --:--:-- --:--:--  1438

In [2]:
import pandas as pd
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

In [3]:
print(pop.head()); print('-'*20); print(areas.head()); print('-'*20); print(abbrevs.head());

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
--------------------
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
--------------------
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [4]:
merged = pd.merge(pop, abbrevs, how='outer', left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', axis=1)
merged.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

In [5]:
merged.isnull()

      state/region   ages   year  population  state
0            False  False  False       False  False
1            False  False  False       False  False
2            False  False  False       False  False
3            False  False  False       False  False
4            False  False  False       False  False
...            ...    ...    ...         ...    ...
2539         False  False  False       False  False
2540         False  False  False       False  False
2541         False  False  False       False  False
2542         False  False  False       False  False
2543         False  False  False       False  False

[2544 rows x 5 columns]

In [6]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [7]:
merged.isnull().sum()

state/region     0
ages             0
year             0
population      20
state           96
dtype: int64

In [8]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
1872           PR  under18  1990         NaN   NaN
1873           PR    total  1990         NaN   NaN
1874           PR    total  1991         NaN   NaN
1875           PR  under18  1991         NaN   NaN
1876           PR    total  1993         NaN   NaN

In [9]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [10]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico' # assign 'Puerto Rico' to 'state' column corresponding to 'PR' in 'state/region'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States' # assign 'United States' to 'state' column corresponding to 'USA' in 'state/region'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [11]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population   state  area (sq. mi)
0           AK    total  1990    553290.0  Alaska       656425.0
1           AK  under18  1990    177502.0  Alaska       656425.0
2           AK    total  1992    588736.0  Alaska       656425.0
3           AK  under18  1991    182180.0  Alaska       656425.0
4           AK  under18  1992    184878.0  Alaska       656425.0

In [12]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [13]:
final['state'][final['area (sq. mi)'].isnull()].unique() # which of the states have 'area (sq. mi)' null

array(['United States'], dtype=object)

In [14]:
final.dropna(inplace=True)
final.isnull().any()

state/region     False
ages             False
year             False
population       False
state            False
area (sq. mi)    False
dtype: bool

In [15]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
43            AK  total  2010    713868.0      Alaska       656425.0
51            AL  total  2010   4785570.0     Alabama        52423.0
141           AR  total  2010   2922280.0    Arkansas        53182.0
149           AZ  total  2010   6408790.0     Arizona       114006.0
197           CA  total  2010  37333601.0  California       163707.0

In [19]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64